Figure/Figure 5/simulations/featureResolved/DUTOTI/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    freeStream
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          100;
        startFace       33730;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       33830;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          170;
        startFace       33930;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          170;
        startFace       34100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17000;
        startFace       34270;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17000;
        startFace       51270;
    }
)

// ************************************************************************* //
